Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Setting up and configuring Hibernate Reactive with Panache
ja_jp: PanacheによるHibernate Reactiveのセットアップと設定

source: Setting up and configuring MongoDB with Panache
ja_jp: MongoDB with Panacheのセットアップと設定

source: Setting up application.properties
ja_jp: application.propertiesの設定

source: Setting up multiple persistence units
ja_jp: 複数の永続化ユニットの設定

source: Setting up support for Flyway
ja_jp: Flywayのサポートのセットアップ

source: Setting up support for Liquibase
ja_jp: Liquibaseのサポートをセットアップする

source: Setting up the analyzers
ja_jp: アナライザーのセットアップ

source: Setting up the default TLS configuration, defined directly under `+quarkus.tls.*+`
ja_jp: デフォルトの TLS 設定を設定する (`+quarkus.tls.*+` の直下に定義)。

source: Setting up the model
ja_jp: モデルのセットアップ

source: Settings
ja_jp: 設定

source: Settings are stored in `~/.quarkus/chappie/chappie-assistant.properties`.
ja_jp: 設定は `~/.quarkus/chappie/chappie-assistant.properties` に保存されます。

source: Setup a router at the start up, nearly exactly as it was done in the `MainVerticle` class in the <<vertx-oidc-vertx>> section, with only a small difference, see the next point.
ja_jp: 起動時にルーターをセットアップします。これは、 <<vertx-oidc-vertx>> セクションの `MainVerticle` クラスで行ったのとほぼ同じですが、次のポイントで述べるわずかな違いがあります。

source: Setup a sampler, that uses a constant sampling strategy.
ja_jp: 一定のサンプリング戦略を使用するサンプラーの設定

source: Several enhancements have been made to the gRPC extensions, such as the support of `InProcess`.
ja_jp: `InProcess` のサポートなど、gRPC エクステンションはいくつも強化されました。

source: Several improvements were made to our HTTP graceful shutdown, thanks to some work from the Keycloak team.
ja_jp: Keycloak チームの作業により、HTTP の優雅なシャットダウンにいくつかの改善が加えられました。

source: Several options are available for selecting the tenant configuration which should be used to secure the current HTTP request for both `service` and `web-app` OIDC applications, such as:
ja_jp: `service` と `web-app` の両方の OIDC アプリケーションの現在の HTTP リクエストを保護するために使用する必要があるテナント設定を選択する際には、次のようないくつかのオプションを使用できます。

source: Severity mappings
ja_jp: 重症度マッピング

source: Severity: only Error and (Weak) Warning are respected. Other values mean no errors will be reported
ja_jp: Severity: Errorと(弱い)Warningのみが尊重される。それ以外の値ではエラーは報告されません。

source: Share in our excitement when the project receives <a href="{{site.baseurl}}/awards">awards and recognition</a> for all of the hard work done by the community.
ja_jp: コミュニティによって行われた全てのハードワークに対して<a href="{{site.baseurl}}/awards">賞と表彰</a>を受けた時、興奮を分かち合いましょう。

source: Shared Data Index
ja_jp: 共有Data Index

source: Shared Elasticsearch
ja_jp: 共有Elasticsearch

source: Shared broker
ja_jp: 共有ブローカー

source: Shared cluster
ja_jp: 共有クラスター

source: Shared permission checks
ja_jp: 共有権限チェック

source: Shared permissions are always applied before unshared ones, therefore a `SecurityIdentity` with the `root` role will have the `user` role as well.
ja_jp: 共有権限は常に非共有権限の前に適用されるため、 `root` ロールを持つ `SecurityIdentity` には `user` ロールも付与されます。

source: Shared registry
ja_jp: 共有レジストリ

source: Shared server
ja_jp: 共有サーバー

source: Sharing LRA coordinator
ja_jp: LRA コーディネーターの共有

source: Sharing a transaction between multiple services is possible but is currently an advanced use case only and the Narayana documentation should be consulted if this behaviour is required. In particular, STM does not yet support the features described in the xref:context-propagation.adoc[Context Propagation guide].
ja_jp: 複数のサービス間でトランザクションを共有することは可能ですが、これは現在のところ高度なユースケースであり、この動作が必要な場合はNarayanaのドキュメントを参照してください。特に、STM は link:context-propagation.html[Context Propagation ガイド]で説明されている機能をまだサポートしていません。

source: Sharing configured CDI instances of ManagedExecutor and ThreadContext
ja_jp: ManagedExecutorとThreadContextの構成されたCDIインスタンスの共有

source: Sharing is enabled by default in dev mode, but disabled in test mode. You can disable the sharing with `quarkus.amqp.devservices.shared=false`.
ja_jp: 共有は、devモードではデフォルトで有効ですが、testモードでは無効です。 `quarkus.amqp.devservices.shared=false` で共有を無効にすることが出来ます。

source: Sharing is enabled by default in dev mode, but disabled in test mode. You can disable the sharing with `quarkus.apicurio-registry.devservices.shared=false`.
ja_jp: 共有は、開発モードではデフォルトで有効ですが、testモードでは無効です。 `quarkus.apicurio-registry.devservices.shared=false` で共有を無効にすることが可能です。

source: Sharing is enabled by default in dev mode, but disabled in test mode. You can disable the sharing with `quarkus.elasticsearch.devservices.shared=false`.
ja_jp: 共有は、devモードではデフォルトで有効ですが、testモードでは無効です。共有は `quarkus.elasticsearch.devservices.shared=false` で無効にすることができます。

source: Sharing is enabled by default in dev mode, but disabled in test mode. You can disable the sharing with `quarkus.infinispan-client.devservices.shared=false`
ja_jp: 共有は、devモードではデフォルトで有効ですが、testモードでは無効です。 `quarkus.infinispan-client.devservices.shared=false` で共有を無効にすることが出来ます。

source: Sharing is enabled by default in dev mode, but disabled in test mode. You can disable the sharing with `quarkus.infinispan-client.devservices.shared=false`.
ja_jp: 共有は、開発モードではデフォルトで有効ですが、テストモードでは無効になります。 共有は `quarkus.infinispan-client.devservices.shared=false` で無効にすることができます。

source: Sharing is enabled by default in dev mode, but disabled in test mode. You can disable the sharing with `quarkus.kafka.devservices.shared=false`.
ja_jp: 共有は、devモードではデフォルトで有効ですが、testモードでは無効です。 `quarkus.kafka.devservices.shared=false` で共有を無効に設定可能です。

source: Sharing is enabled by default in dev mode, but disabled in test mode. You can disable the sharing with `quarkus.kubernetes-client.devservices.shared=false`.
ja_jp: 共有は、devモードではデフォルトで有効ですが、testモードでは無効です。共有は `quarkus.kubernetes-client.devservices.shared=false` で無効にできます。

source: Sharing is enabled by default in dev mode, but disabled in test mode. You can disable the sharing with `quarkus.lra.devservices.shared=false`.
ja_jp: 共有は開発モードではデフォルトで有効ですが、テストモードでは無効です。`quarkus.lra.devservices.shared=false` で共有を無効にできます。

source: Sharing is enabled by default in dev mode, but disabled in test mode. You can disable the sharing with `quarkus.mongodb.devservices.shared=false`.
ja_jp: 共有はdevモードではデフォルトで有効ですが、testモードでは無効になります。共有は `quarkus.mongodb.devservices.shared=false` で無効にできます。

source: Sharing is enabled by default in dev mode, but disabled in test mode. You can disable the sharing with `quarkus.pulsar.devservices.shared=false`.
ja_jp: 開発モードでは共有はデフォルトで有効になっていますが、テストモードでは無効になっています。 `quarkus.pulsar.devservices.shared=false` で共有を無効にできます。

source: Sharing is enabled by default in dev mode, but disabled in test mode. You can disable the sharing with `quarkus.rabbitmq.devservices.shared=false`.
ja_jp: 共有は、devモードではデフォルトで有効ですが、testモードでは無効です。 `quarkus.rabbitmq.devservices.shared=false` で共有を無効にすることが可能です。

source: Sharing is enabled by default in dev mode, but disabled in test mode. You can disable the sharing with `quarkus.redis.devservices.shared=false`.
ja_jp: 共有は、devモードではデフォルトで有効ですが、testモードでは無効です。 `quarkus.redis.devservices.shared=false` で共有を無効にすることが可能です。

source: Sharing is enabled by default in dev mode. You can disable the sharing with `quarkus.kogito.devservices.shared=false`.
ja_jp: devモードでは、デフォルトで共有が有効になっています。 `quarkus.kogito.devservices.shared=false` で共有を無効にすることができます。

source: Sharing the same value for `quarkus.test.arg-line` might break integration test runs that test different types of Quarkus artifacts. In such cases, the use of Maven profiles is advised.
ja_jp: `quarkus.test.arg-line` で同じ値を共有すると、異なるタイプの Quarkus アーティファクトをテストする統合テストの実行が中断される場合があります。このような場合は、Mavenプロファイルの使用することをお勧めします。

source: Sharing the same value for `quarkus.test.arg-line` might break integration test runs that test different types of Quarkus artifacts. In such cases, the use of maven profiles is advised.
ja_jp: `quarkus.test.arg-line` で同じ値を共有すると、異なるタイプのQuarkusアーティファクトをテストする結合テストが壊れる可能性があります。このような場合には、mavenプロファイルの使用をお勧めします。

source: Shell autocomplete and aliases
ja_jp: シェルのオートコンプリートとエイリアス

source: Short Form
ja_jp: ショートフォーム

source: Short and focused exercises to get you going quickly.
ja_jp: 短く、フォーカスされた入門エクササイズ

source: Short informative videos that highlight unique technical points and instructions on how to get the most out of Quarkus.
ja_jp: Quarkusを最大限に活用するためのユニークな技術的ポイントと手順をハイライトした短い参考になるビデオ。

source: Short name that could be used to quickly locate an extension in the catalog of extensions provided by the dev tools to the users
ja_jp: 開発ツールがユーザーに提供するエクステンションのカタログから、そのエクステンションをすばやく見つけるために使用できる短縮名

source: Short names of images
ja_jp: イメージの略称

source: Shortcut
ja_jp: ショートカット

source: Shortcut type
ja_jp: ショートカットタイプ

source: Shortcuts
ja_jp: ショートカット

source: Shortening is implemented by hashing the node name, encoding the hash to Base64 and then truncating the result. As with all hashes, the resulting shortened node name could potentially conflict with another shortened node name, but it is https://github.com/quarkusio/quarkus/issues/30491#issuecomment-1537247764[very unlikely].
ja_jp: 短縮は、ノード名をハッシュし、そのハッシュをBase64にエンコードし、その結果を切り捨てることで実装されます。 すべてのハッシュと同様に、短縮された結果のノード名は他の短縮されたノード名と衝突する可能性がありますが、その link:https://github.com/quarkusio/quarkus/issues/30491#issuecomment-1537247764[可能性はほとんどありません]。

source: Shorter sentences are much easier to read and translate. Try to use less than 32 words per sentence.
ja_jp: 短い文章は読みやすく、翻訳しやすいです。一文に使う単語数は32語以下になるように心がけましょう。

source: Shorthand for if-then-else statement. Unlike in <<if_section>> nested operators are not supported.
ja_jp: if-then-else 文の省略形。<<if_section>> とは異なり、入れ子式の演算子はサポートされていません。

source: Shorthand for if-then-else statement. Unlike in xref:if_section[If Section] nested operators are not supported.
ja_jp: if-then-else文の省略形。 xref:if_section[Ifセクション] と異なり、入れ子の演算子はサポートされていません。

source: Should ...
ja_jp: 以下を行う必要があります

source: Should I Use Funqy?
ja_jp: Funqy を使うべきか？

source: Should you need to configure more OIDC tenant properties, use the `OidcTenantConfig` builder like in the example below:
ja_jp: さらに多くの OIDC テナントプロパティーを設定する必要がある場合は、次の例のように `OidcTenantConfig` ビルダーを使用します。

source: Should you write an extension?
ja_jp: エクステンションを作成すべきか

source: Shouldn't rely on any metadata as it could be used at any time in any phase of the bootstrap
ja_jp: ブートストラップのどのフェーズでもいつでも使えるので、メタデータに頼るべきではありません。

source: Show how Quarkus can help facilitate local development of independent microservices.
ja_jp: 独立したマイクロサービスのローカル開発を促進するために、Quarkusがどのように役立つかを紹介していること。

source: Show me some examples!
ja_jp: 例を見せてください!

source: Show me the code!
ja_jp: コードを見せてください！

source: Show me!
ja_jp: 見せて!

source: Shows all configuration options (with current, default, and documentation info). Includes a config editor (text & form modes).
ja_jp: すべての設定オプション (現在、デフォルト、およびドキュメント情報を含む) を表示します。設定エディター (テキストおよびフォームモード) も含まれます。

source: Shows all runtime and deployment dependencies with dependency path exploration and search functionality.
ja_jp: すべてのランタイムおよびデプロイメントの依存関係を、依存関係パスの探索および検索機能とともに表示します。

source: Shows the version of the main library powering the extension (if any).
ja_jp: エクステンションを駆動する主要ライブラリのバージョンを表示します (もしあれば)。

source: Shut down Quarkus and exit the JVM after the main method returns
ja_jp: mainメソッドが返った後にQuarkusをシャットダウンし、JVMを終了します

source: Shutdown is always initiated by the application main thread returning. If you want to run some logic on startup, and then run like a normal application (i.e. not exit) then you should call `Quarkus.waitForExit` from the main thread (A non-command mode application is essentially just running an application that just calls `waitForExit`).
ja_jp: シャットダウンは常にアプリケーションのメインスレッドがreturnされることで開始されます。起動時に何らかのロジックを実行して、通常のアプリケーションのように実行したい場合 (つまり終了しない) は、メインスレッドから `Quarkus.waitForExit` を呼び出す必要があります (非コマンドモードのアプリケーションは、基本的に `waitForExit` を呼び出すだけのアプリケーションを実行しているだけです)。

source: Sign CSRF token
ja_jp: CSRFトークンに署名

source: Sign all files with GPG. In our case we did not configure this step thus it's skipped.
ja_jp: すべてのファイルにGPGで署名します。ここでは、このステップを設定していないので、スキップされます。

source: Sign in to Keycloak as `admin:admin` in order to further customize the realm properties, create or import a new realm, export the realm.
ja_jp: レルムのプロパティーのカスタマイズ、新規レルムの作成またはインポート、レルムのエクスポートを実行するには、Keycloak に `admin:admin` としてサインインします。

source: Sign in to Keycloak as `admin:admin` to further customize the realm properties, create or import a new realm, or export the realm.
ja_jp: レルムのプロパティーのカスタマイズ、新規レルムの作成またはインポート、レルムのエクスポートを実行するには、Keycloak に `admin:admin` としてサインインします。

source: Sign the claims
ja_jp: クレームへの署名

source: Sign the claims and encrypt the nested JWT token
ja_jp: クレームへの署名とネストされた JWT トークンの暗号化

source: Signature algorithm
ja_jp: 署名アルゴリズム

source: Signature algorithm. Checked if the JWT signature builder has not already set the signature algorithm.
ja_jp: 署名アルゴリズム。JWT 署名ビルダーが署名アルゴリズムをまだ設定していないかどうかを確認します。

source: Signature algorithm. Set it to `ES256` to support the Elliptic Curve signature algorithm.
ja_jp: 署名アルゴリズム。 `ES256` に設定して、楕円曲線署名アルゴリズムをサポートします。

source: Signature algorithm. This property should only be used for setting a required symmetric algorithm such as `HS256`. It is deprecated for setting asymmetric algorithms such as `ES256` - use 'mp.jwt.verify.publickey.algorithm' instead.
ja_jp: 署名アルゴリズム。このプロパティーは、 `HS256` などの必要な対称アルゴリズムを設定するためにのみ使用する必要があります。 `ES256` などの非対称アルゴリズムの設定に使用することは推奨されません。代わりに 'mp.jwt.verify.publickey.algorithm' を使用してください。

source: Signature algorithm. This property should only be used to set a symmetric algorithm such as `HS256`. It is deprecated for setting asymmetric algorithms such as `ES256` - use 'mp.jwt.verify.publickey.algorithm' instead.
ja_jp: 署名アルゴリズム。このプロパティーは、 `HS256` などの対称アルゴリズムを設定する場合にのみ使用してください。 `ES256` などの非対称アルゴリズムの設定には非推奨です。代わりに 'mp.jwt.verify.publickey.algorithm' を使用してください。

source: Signature algorithm. This property will be checked if the JWT signature builder has not already set the signature algorithm.
ja_jp: 署名アルゴリズム。このプロパティーは、JWT 署名ビルダーが署名アルゴリズムをまだ設定していない場合にチェックされます。

source: Signing key identifier which is checked only when JWK keys are used.
ja_jp: JWK キーを使用する場合にのみチェックされる署名キー識別子。

source: Signing key identifier, checked only when JWK keys are used.
ja_jp: 署名キー識別子。JWK キーが使用される場合にのみチェックされます。

source: Signing the claims is the most common method for securing them. Typically, a JWT token is produced by signing claims formatted as JSON, following the steps outlined in the link:https://tools.ietf.org/html/rfc7515[JSON Web Signature (JWS)] specification.
ja_jp: クレームの署名は、クレームを保護する最も一般的な方法です。 通常、JWT トークンは JSON 形式のクレームに署名することで生成されますが、これは link:https://tools.ietf.org/html/rfc7515[JSON Web Signature (JWS)] 仕様に基づいた手順で行われます。

source: Signing the claims is used most often to secure the claims. What is known today as a JWT token is typically produced by signing the claims in a JSON format using the steps described in the link:https://tools.ietf.org/html/rfc7515[JSON Web Signature] specification.
ja_jp: クレームへの署名は、クレームを保護するために最も頻繁に使用されます。今日において JWT トークンとして知られているものは、通常、link:https://tools.ietf.org/html/rfc7515[JSON Web 署名] の仕様で説明されている手順を使用して、JSON 形式でクレームに署名することによって生成されます。

source: Similar errors are detected at build time if <<typesafe_expressions>> and <<typesafe_templates>> are used.
ja_jp: <<typesafe_expressions>> と <<typesafe_templates>> を使用した場合、ビルド時に同様のエラーが検出されます。

source: Similar errors are detected at build time if xref:typesafe_expressions[Type-safe Expressions] and xref:typesafe_templates[Type-safe Templates] are used.
ja_jp: xref:typesafe_expressions[タイプセーフ式] や xref:typesafe_templates[タイプセーフテンプレート] を使用した場合、ビルド時に同様のエラーが検出されます。

source: Similar to <<synthetic_beans,synthetic beans>>, the attributes of a synthetic observer method are not derived from a Java method. Instead, all the attributes are defined by an extension.
ja_jp: <<synthetic_beans,synthetic beans>> と同様に、合成オブザーバーメソッドの属性は Java メソッドから派生しません。代わりに、すべての属性がエクステンションによって定義されます。

source: Similar to Docker Compose, the https://quay.io/quarkus-super-heroes[pre-built container images^] of the entire application, or a subset of it, can be deployed to Kubernetes with a single `+kubectl apply -f+` (or `+oc apply -f+` if using OpenShift).
ja_jp: Docker Composeと同様に、アプリケーション全体またはそのサブセットの link:https://quay.io/quarkus-super-heroes[事前に構築されたコンテナイメージ, window=_blank]を、1つの `kubectl apply -f` （OpenShiftを使用している場合は `oc apply -f` ）でKubernetesにデプロイすることができます。

source: Similar to custom discovery providers, if the provider is located in an extension, the configuration generator should be declared in the `annotationProcessorPaths` section of the runtime module using the default scope.
ja_jp: カスタム ディスカバリー プロバイダと同様に、プロバイダがエクステンションに配置されている場合は、ランタイム モジュールの `annotationProcessorPaths` セクションでデフォルト スコープを使用して設定ジェネレータを宣言する必要があります。

source: Similar to most language clients, linked editing is now supported for Qute templates , allowing for simultaneous renaming of multiple parameter expressions. To enable this feature, the setting `editor.linkedEditing` must be set to true in your `settings.json`.
ja_jp: 多くの言語クライアントと同様に、Quteテンプレートでも連動編集がサポートされ、複数のパラメータ式の名前を同時に変更することができるようになりました。この機能を有効にするには、 `settings.json` で、 `editor.linkedEditing` を true に設定する必要があります。

source: Similar to the Maven configuration, when using Gradle, the following modifications are required when Kotlin is selected:
ja_jp: Mavenの設定と同様、Gradleを使用する場合、Kotlinを選択すると以下のような修正が必要になります:

source: Similar to the `createHero` mutation method we also retrieve the `name` and `surname` of the hero we have deleted which is defined in `{ }`.
ja_jp: `createHero` の mutation 法と同様に、 `{ }` で定義されている削除したヒーローの `name` と `surname` も取得します。

source: Similar to the negative acknowledgement, with the https://pulsar.apache.org/docs/3.0.x/concepts-messaging/#acknowledgment-timeout[acknowledgement timeout] mechanism, the Pulsar client tracks the unacknowledged messages, for the given *ackTimeout* period and sends *redeliver unacknowledged messages request* to the broker, thus the broker resends the unacknowledged messages to the consumer.
ja_jp: Pulsar クライアントは、否定応答と同様に、 https://pulsar.apache.org/docs/3.0.x/concepts-messaging/#acknowledgment-timeout[確認応答タイムアウト] メカニズムにより、指定された *ackTimeout* 期間にわたって、確認応答されていないメッセージを追跡し、ブローカーに *確認応答されていないメッセージの再配信リクエスト* を送信します。これを受けて、ブローカーは確認応答されていないメッセージをコンシューマーに再送信します。

source: Similar to the previous example, multiple instances of an application can subscribe to a single consumer group, configured via `mp.messaging.incoming.$channel.group.id` property, or left default to the application name. This in turn will divide partitions of the topic among application instances.
ja_jp: 前の例と同様に、アプリケーションの複数のインスタンスは、 `mp.messaging.incoming.$channel.group.id` プロパティーを介して設定された単一のコンシューマーグループにサブスクライブすることも、アプリケーション名をデフォルトのままにすることもできます。 これにより、トピックのパーティションがアプリケーションインスタンス間で分割されます。

source: Similar to the simple `query` method, `preparedQuery` returns an instance of `PreparedQuery<RowSet<Row>>`. Equipped with this tooling, we are able to safely use an `id` provided by the user to get the details of a particular fruit:
ja_jp: 単純な `query` メソッドと同様に、 `preparedQuery` は `PreparedQuery<RowSet<Row>>` のインスタンスを返します。このツールを装備すると、ユーザーから提供された `id` を安全に使用して、特定の fruit の詳細を取得できます。

source: Similarly for Gradle projects, you also just have to add the `quarkus-amazon-lambda` dependency. The extension automatically generates everything you might need for your lambda deployment.
ja_jp: 同様に、Gradle プロジェクトの場合も、 `quarkus-amazon-lambda` 依存関係を追加する必要があります。エクステンションは、Lambda デプロイメントに必要なすべてのものを自動的に生成します。

source: Similarly to HTTP, alongside the message, gRPC calls can carry headers. Headers can be useful e.g. for authentication.
ja_jp: HTTPと同様に、gRPCの呼び出しはメッセージと一緒にヘッダを運ぶことができます。 ヘッダは、例えば、認証のために有用です。

source: Similarly to `@Broadcast`, you can use `@Outgoing` annotation multiple times on the same method to indicate that the method produces messages to multiple channels:
ja_jp: `@Broadcast` と同様に、同じメソッドで `@Outgoing` アノテーションを複数回使用して、このメソッドが複数のチャネルにメッセージを生成することを示すことができます。

source: Similarly to `@Merge`, you can use `@Incoming` annotation multiple times on the same method to indicate that the method consumes messages from multiple channels:
ja_jp: `@Merge` と同様に、同じメソッドで `@Incoming` アノテーションを複数回使用して、メソッドが複数のチャネルからのメッセージを消費することを示すことができます。

source: Similarly to `ServiceDiscoveryProvider, a `LoadBalancerProvider` implementation needs to be annotated with `@LoadBalancerType` that defines the _type_. Any configuration properties that the provider expects should be defined with `@LoadBalancerAttribute` annotations placed on the provider.
ja_jp: `ServiceDiscoveryProvider` と同様に、 `LoadBalancerProvider` の実装は _type_ を定義する `@LoadBalancerType` のアノテーションが必要です。プロバイダーが期待する設定プロパティは、プロバイダーに置かれた `@LoadBalancerAttribute` のアノテーションで定義する必要があります。

source: Similarly to `ServiceDiscoveryProvider`, a `LoadBalancerProvider` implementation needs to be annotated with `@LoadBalancerType` that defines the _type_. Any configuration properties that the provider expects should be defined with `@LoadBalancerAttribute` annotations placed on the provider.
ja_jp: `ServiceDiscoveryProvider` と同様に、 `LoadBalancerProvider` の実装は _type_ を定義する `@LoadBalancerType` のアノテーションが必要です。プロバイダーが期待する設定プロパティは、プロバイダーに置かれた `@LoadBalancerAttribute` のアノテーションで定義する必要があります。

source: Similarly to the `CRUDResource` example, the following example shows how you can grant a user with the `admin` role permissions to update `MediaLibrary`:
ja_jp: `CRUDResource` の例と同様に、次の例は、 `admin` ロールを持つユーザーに `MediaLibrary` を更新する権限を付与する方法を示しています。

source: Similarly you can disable the schema (usually under `/openapi`) by doing:
ja_jp: 同様に、以下のようにしてスキーマを無効にすることができます (通常は `/openapi` の下にあります):

source: Similarly you can exclude a particular Qute template from validation, or its entire module
ja_jp: 同様に、特定のQuteテンプレートを検証から除外したり、モジュール全体を除外したりすることもできます。

source: Similarly, Quarkus REST can produce Multipart Form data to allow users download files from the server. For example, we could write a POJO that will hold the information we want to expose as:
ja_jp: 同様に、Quarkus REST は、ユーザーがサーバーからファイルをダウンロードできるようにするための Multipart Form データを生成できます。たとえば、公開する情報を保持する POJO を、次のように記述できます。

source: Similarly, Quarkus allows extensions authors to register a `NativeImageProxyDefinitionBuildItem`. An example of doing so is:
ja_jp: 同様に、Quarkus では拡張機能の作成者が `NativeImageProxyDefinitionBuildItem` を登録できます。その例は次のとおりです。

source: Similarly, RESTEasy Reactive can produce Multipart Form data to allow users download files from the server. For example, we could write a POJO that will hold the information we want to expose as:
ja_jp: 同様に、RESTEasy Reactive は、ユーザーがサーバーからファイルをダウンロードできるようにするための Multipart Form データを生成することができます。例えば、公開したい情報を保持する POJO を、次のように書くことができます。

source: Similarly, `quarkus-oidc-token-propagation` allows user of the legacy REST to propagate the current `Bearer` or `Authorization Code Flow` access tokens.
ja_jp: 同様に、 `quarkus-oidc-token-propagation` は、従来の REST のユーザーが現在の `Bearer` または `Authorization Code Flow` のアクセストークンを伝搬することを可能にします。

source: Similarly, `quarkus-rest-client-oidc-token-propagation` allows user of the legacy REST to propagate the current `Bearer` or `Authorization Code Flow` access tokens.
ja_jp: 同様に、 `quarkus-rest-client-oidc-token-propagation` は、従来の REST のユーザーが現在の `Bearer` または `Authorization Code Flow` のアクセストークンを伝搬することを可能にします。

source: Similarly, `quarkus.oidc.authentication.state-cookie-same-site` defines a `Same-Site` attribute for a state cookie as `lax` by default, but setting it to `strict` is RECOMMENDED when it is known to work in your deployment.
ja_jp: 同様に、 `quarkus.oidc.authentication.state-cookie-same-site` は State Cookie の `Same-Site` 属性をデフォルトで `lax` と定義していますが、デプロイメントで正常に動作することがわかっている場合は `strict` に設定することが推奨されます。

source: Similarly, for Gradle projects, you also just have to add the `quarkus-amazon-lambda` dependency. The extension automatically generates everything you might need for your lambda deployment.
ja_jp: 同様に、Gradle プロジェクトの場合も、 `quarkus-amazon-lambda` 依存関係を追加する必要があります。エクステンションは、Lambda デプロイメントに必要なすべてのものを自動的に生成します。
